#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/example-org-f66d79/dns-main/runs/run-wCgjNXAFQzMsDND8

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
data.aws_route53_zone.selected: Reading...
aws_route53_zone.terraform-subzone: Refreshing state... [id=Z07847533D9B8JNF7QMBA]
aws_route53_record.terraform-ns: Refreshing state... [id=Z1ZGYX2ZIYACUH_tf.therealbenforce.com_NS]
data.aws_route53_zone.selected: Read complete after 0s [id=Z1ZGYX2ZIYACUH]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.terraform-ns will be destroyed
  # (because aws_route53_record.terraform-ns is not in configuration)
  - resource "aws_route53_record" "terraform-ns" {
      - fqdn                             = "tf.therealbenforce.com" -> null
      - id                               = "Z1ZGYX2ZIYACUH_tf.therealbenforce.com_NS" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "tf.therealbenforce.com" -> null
      - records                          = [
          - "ns-1297.awsdns-34.org",
          - "ns-2022.awsdns-60.co.uk",
          - "ns-59.awsdns-07.com",
          - "ns-711.awsdns-24.net",
        ] -> null
      - ttl                              = 30 -> null
      - type                             = "NS" -> null
      - zone_id                          = "Z1ZGYX2ZIYACUH" -> null
    }

  # aws_route53_record.terraform_ns will be created
  + resource "aws_route53_record" "terraform_ns" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "tf.therealbenforce.com"
      + records         = (known after apply)
      + ttl             = 30
      + type            = "NS"
      + zone_id         = "Z1ZGYX2ZIYACUH"
    }

  # aws_route53_zone.terraform-subzone will be destroyed
  # (because aws_route53_zone.terraform-subzone is not in configuration)
  - resource "aws_route53_zone" "terraform-subzone" {
      - arn                 = "arn:aws:route53:::hostedzone/Z07847533D9B8JNF7QMBA" -> null
      - comment             = "All subdomains created by terraform will be created here" -> null
      - force_destroy       = false -> null
      - id                  = "Z07847533D9B8JNF7QMBA" -> null
      - name                = "tf.therealbenforce.com" -> null
      - name_servers        = [
          - "ns-1297.awsdns-34.org",
          - "ns-2022.awsdns-60.co.uk",
          - "ns-59.awsdns-07.com",
          - "ns-711.awsdns-24.net",
        ] -> null
      - primary_name_server = "ns-59.awsdns-07.com" -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
      - zone_id             = "Z07847533D9B8JNF7QMBA" -> null
    }

  # aws_route53_zone.terraform_subzone will be created
  + resource "aws_route53_zone" "terraform_subzone" {
      + arn                 = (known after apply)
      + comment             = "All subdomains created by terraform will be created here"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "tf.therealbenforce.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + hosted_zone_id  = (known after apply)
  + tf_subzone_name = "tf.therealbenforce.com"
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-wCgjNXAFQzMsDND8/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-wCgjNXAFQzMsDND8/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pushed by: @TheRealBenForce, Action: `pull_request`*